Revit 2027 API
BuiltInFailures.ExtendedPropertiesLinkFailures.IncompatibleValue Property
 The dataset contained a property value that is incompatible with the property definition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId IncompatibleValue { get; }
Public Shared ReadOnly Property IncompatibleValue As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ IncompatibleValue {
	FailureDefinitionId^ get ();
}
static member IncompatibleValue : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ExtendedPropertiesLinkFailures Class
Autodesk.Revit.DB Namespace